In [7]:
import pandas as pd
import numpy as np

In [45]:
data={
    'data':['2021-12-01','01-12-2021','2022/12/01','12-01-2021'],
    'country':['USA','U.S.A','America','United States'],
    'names':['Asma','Asma','Ammar','Asmar'],
    'sales_2020':[100,200,None,200],
    'sales_2021':[None,150,300,150]

}
# data
## makes pandas dataframe
df=pd.DataFrame(data)
df

         data        country  names  sales_2020  sales_2021
0  2021-12-01            USA   Asma       100.0         NaN
1  01-12-2021          U.S.A   Asma       200.0       150.0
2  2022/12/01        America  Ammar         NaN       300.0
3  12-01-2021  United States  Asmar       200.0       150.0

In [46]:
df.head()

         data        country  names  sales_2020  sales_2021
0  2021-12-01            USA   Asma       100.0         NaN
1  01-12-2021          U.S.A   Asma       200.0       150.0
2  2022/12/01        America  Ammar         NaN       300.0
3  12-01-2021  United States  Asmar       200.0       150.0

In [47]:
## standardizing the date format  //Data Inconsistency format

df['data']=pd.to_datetime(df['data'],errors='coerce')
df['data']=df['data'].dt.strftime('%Y-%m-%d')
df.head()

         data        country  names  sales_2020  sales_2021
0  2021-12-01            USA   Asma       100.0         NaN
1         NaN          U.S.A   Asma       200.0       150.0
2         NaN        America  Ammar         NaN       300.0
3         NaN  United States  Asmar       200.0       150.0

#### fill the date and try and other method to complete the date format inconsistencies

In [48]:
df['data']=df['data'].ffill()
df['data']

0    2021-12-01
1    2021-12-01
2    2021-12-01
3    2021-12-01
Name: data, dtype: object

In [49]:
df.head()

         data        country  names  sales_2020  sales_2021
0  2021-12-01            USA   Asma       100.0         NaN
1  2021-12-01          U.S.A   Asma       200.0       150.0
2  2021-12-01        America  Ammar         NaN       300.0
3  2021-12-01  United States  Asmar       200.0       150.0

### Harmonize the name of the country

In [37]:
### INconsistency naming convention
country_mapping={'USA':'United State','U.S.A':'United State','America':'United State'}
df['country']=df['country'].replace(country_mapping)

In [38]:
df['country']

0     United State
1     United State
2     United State
3    United States
Name: country, dtype: object

### correct the typographical mistake in names

In [39]:
df['names']=df['names'].replace({'Asma':'Asma Aslam','Asmar':'Ammar'})
df.head()

         data        country       names  sales_2020  sales_2021
0  2021-12-01   United State  Asma Aslam       100.0         NaN
1  2021-12-01   United State  Asma Aslam       200.0       150.0
2  2021-12-01   United State       Ammar         NaN       300.0
3  2021-12-01  United States       Ammar       200.0       150.0

In [40]:
### Remove Duplicates

In [43]:
df.drop_duplicates()   # see all the columns
df.head()

         data       country       names  sales_2020  sales_2021
0  2021-12-01  United State  Asma Aslam       100.0         NaN
2  2021-12-01  United State       Ammar         NaN       300.0

In [42]:
df=df.drop_duplicates(subset="names")    
df.head()

         data       country       names  sales_2020  sales_2021
0  2021-12-01  United State  Asma Aslam       100.0         NaN
2  2021-12-01  United State       Ammar         NaN       300.0

In [44]:
df.head()

         data       country       names  sales_2020  sales_2021
0  2021-12-01  United State  Asma Aslam       100.0         NaN
2  2021-12-01  United State       Ammar         NaN       300.0

In [50]:
df.head()

         data        country  names  sales_2020  sales_2021
0  2021-12-01            USA   Asma       100.0         NaN
1  2021-12-01          U.S.A   Asma       200.0       150.0
2  2021-12-01        America  Ammar         NaN       300.0
3  2021-12-01  United States  Asmar       200.0       150.0

In [51]:
## Contradictory
df=df.drop(df[df['sales_2021']<= df['sales_2020']].index)
df

         data  country  names  sales_2020  sales_2021
0  2021-12-01      USA   Asma       100.0         NaN
2  2021-12-01  America  Ammar         NaN       300.0